app/controllers/comments_controller.rb

  def create
    params.permit!
    @image_id = params[:image_id]
    @image = Image.find(params[:image_id])
    @comment = @image.comments.create(params[:comment])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("description", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?)  [["description", "e"], ["created_at", 2016-08-31 17:36:22 UTC], ["updated_at", 2016-08-31 17:36:22 UTC], ["image_id", 10]]

  def destroy
    @image = Image.find(params[:image_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]