app/controllers/images_controller.rb

INSERT INTO "images" ("description", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @image = Image.new(image_params)
    @image.user = current_user

    if @image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy