app/controllers/pages_controller.rb

SELECT "images".* FROM "images" WHERE "images"."user_id" = ? ORDER BY "images"."id" DESC  [["user_id", 1]]
---
  def show
  	@images = current_user.images.order(id: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def friendship
  	@frnd = User.find(params[:q])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def accept
    @frnd = User.find(params[:format])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def decline
    @frnd = User.find(params[:format])

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def like
    @img = Image.find(params[:format])